In [1]:
import pandas as pd
import numpy as np

In [3]:
left = pd.DataFrame({
    "id_l":[1,2,3,4,5],
    "Name_l":["Alex","Amy","Allen","Alice","Ayoung"],
    "subject_id":["sub1","sub2","sub4","sub6","sub5"]})

right=pd.DataFrame({
    "id_r":[1,2,3,4],
    "Name_r":["Billy","Brian","Bran","Bryce"],
    "subject_id":["sub2","sub4","sub3","sub6"]})

In [19]:
left.merge(right,how="left",on="subject_id")

   id_l  Name_l subject_id  id_r Name_r
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   NaN    NaN

In [24]:
left_df = pd.DataFrame({
    "subject_id":[1,2,3,4,5],
    "first_name":["Alex","Amy","Allen","Alice","Ayoung"],
    "last_name":["Anderson","Ackerman","Ali","Aoni","Atiches"]
})

right_df = pd.DataFrame({
    "subject_id":[4,5,6,7,8],
    "first_name":["Billy","Brian","Bran","Bryce","Betty"],
    "last_name":["Bonder","Black","Balwner","Brice","Btisan"]
})

In [27]:
left_df.merge(right_df,on="subject_id",how="right")

   subject_id first_name_x last_name_x first_name_y last_name_y
0           4        Alice        Aoni        Billy      Bonder
1           5       Ayoung     Atiches        Brian       Black
2           6          NaN         NaN         Bran     Balwner
3           7          NaN         NaN        Bryce       Brice
4           8          NaN         NaN        Betty      Btisan

In [28]:
left.merge(right,on="subject_id",how="outer")

   id_l  Name_l subject_id  id_r Name_r
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   NaN    NaN
5   NaN     NaN       sub3   3.0   Bran

In [30]:
employee_l=pd.DataFrame({
    "employee":["Bob","Jake","Lisa","Sue"],
    "group":["Accounting","Engeneering","Engeneering","HR"]
})
employee_r=pd.DataFrame({
    "name":["Bob","Jake","Lisa","Sue"],
    "salary":[70000,80000,120000,90000]
})

In [ ]:
employee_l.merge()